#include <functional>
#include <string>
#include <regex>
#include <sstream>
#include <iostream>
#include <fstream>
#include <chrono>
#include <limits>
#include <atomic>

#include "xbyak/xbyak.h"
#include "common/IDebugLog.h"  // IDebugLog
#include "skse64_common/skse_version.h"  // RUNTIME_VERSION
#include "skse64/PluginAPI.h"  // SKSEInterface, PluginInfo
#include "skse64/GameRTTI.h"
#include "skse64/GameSettings.h"
#include "skse64/NiNodes.h"
#include "skse64/NiObjects.h"
#include "skse64/NiExtraData.h"
#include "skse64/GameData.h"
#include "skse64/GameForms.h"
#include "skse64/PapyrusActor.h"
#include "skse64/GameVR.h"
#include "skse64_common/SafeWrite.h"
#include "skse64_common/BranchTrampoline.h"

#include <ShlObj.h>  // CSIDL_MYDOCUMENTS

#include "RE/offsets.h"
#include "version.h"
#include "config.h"
#include "utils.h"
#include "math_utils.h"
#include "RE/havok.h"
#include "havok_ref_ptr.h"

#include <Physics/Dynamics/Entity/hkpRigidBody.h>
#include <Physics/Utilities/Collide/TriggerVolume/hkpTriggerVolume.h>
#include <Physics/Dynamics/Collide/ContactListener/hkpContactListener.h>
#include <Animation/Ragdoll/Instance/hkaRagdollInstance.h>
#include <Animation/Ragdoll/Controller/RigidBody/hkaRagdollRigidBodyController.h>
#include <Animation/Animation/Mapper/hkaSkeletonMapper.h>
#include <Physics/Dynamics/Constraint/Bilateral/Ragdoll/hkpRagdollConstraintData.h>
#include <Physics/Dynamics/Constraint/Bilateral/LimitedHinge/hkpLimitedHingeConstraintData.h>
#include <Physics/Dynamics/Constraint/Motor/Position/hkpPositionConstraintMotor.h>
#include <Physics/Dynamics/World/Extensions/hkpWorldExtension.h>


// SKSE globals
static PluginHandle	g_pluginHandle = kPluginHandle_Invalid;
static SKSEMessagingInterface *g_messaging = nullptr;

SKSEVRInterface *g_vrInterface = nullptr;
SKSETrampolineInterface *g_trampoline = nullptr;

bool initComplete = false; // Whether hands have been initialized


// Potentially, could hook TESObjectREFR::InitHavok to set the collision layer for the weapon when we drop it so it doesn't collide with the bumper

// RightMeleeContactListener : hkpContactListener is at 0x2FFFDD0
// LeftMeleeContactListener : hkpContactListener is at 0x2FFFDD8
// May be flipped in left handed mode, I dunno

// 6B03D0 - inits some VR melee things in the PlayerCharacter from ini settings when switching weapons

// For setting transform of our trigger, probably hook at 0x6E5258

// 2AE5E0 - recursive check of node for collision when weapon swing - 2AFAA0 does the actual checks for a single node - 2ADFD0 is the one that does it on the BSFadeNode root of a TESObjectREFR
// ^^ Takes in BSFadeNode *, NiPoint3 * to position of the weapon hit? and checks which node within is the intersecting one?
// ^^ It gets passed the location of the WEAPON node during a weapon swing

// 60C808 - address of call to TESObjectREFR_EndHavokHit in Actor::KillImpl


struct HavokHitJob
{
	NiPoint3 position; // 00
	NiPoint3 direction; // 0C
	UInt32 refHandle; // 18
	UInt32 endTimeMilliseconds = -1; // 1C
};
static_assert(sizeof(HavokHitJob) == 0x20);

struct HavokHitJobs
{
	UInt64 unk00;
	// Actually this is a BSTSmallArray<HavokHitJob> from this point
	UInt32 unk08 = 0x80000000;
	UInt32 pad0C;
	HavokHitJob jobs[5]; // 10
	UInt32 numJobs = 5; // B0
};
static_assert(offsetof(HavokHitJobs, jobs) == 0x10);
static_assert(offsetof(HavokHitJobs, numJobs) == 0xB0);

struct hkbWorldFromModelModeData
{
	hkInt16 poseMatchingBone0; // 00
	hkInt16 poseMatchingBone1; // 02
	hkInt16 poseMatchingBone2; // 04
	UInt8 mode; // 06
};

struct hkbRagdollDriver : hkReferencedObject
{
	hkReal ragdollBlendOutTime; // 10
	hkbWorldFromModelModeData worldFromModelModeData; // 14
	hkBool autoAddRemoveRagdollToWorld; // 1C
	hkBool useAsynchronousStepping; // 1D
	hkQsTransform lastWorldFromModel; // 20
	hkbWorldFromModelModeData worldFromModelModeDataInternal; // 50
	hkArray<hkBool32> reportingWhenKeyframed; // 58 - Indexed by (boneIdx >> 5), and then you >> (boneIdx & 0x1F) & 1 to extract the specific bit
	UInt64 unk68; // numRagdollBones?
	hkPointerMap<hkReferencedObject *, hkBool32> attachedRigidBodyToIndexMap; // 70 - maybe
	struct hkbCharacter *character; // 80
	hkaRagdollInstance *ragdoll; // 88
	hkQsTransform *ragdollPoseWS; // 90
	hkaRagdollRigidBodyController *ragdollController; // 98
	hkQsTransform *ragdollPoseHiResLocal; // A0 - maybe
	hkQsTransform *lastPoseLocal; // A8
	SInt32 lastNumPoseLocal; // B0
	float lastFrameRigidBodyOnFraction; // B4
	float lastFramePoweredOnFraction; // B8
	float timeRigidBodyControllerActive; // BC
	float ragdollBlendOutTimeElapsed; // C0
	hkBool canAddRagdollToWorld; // C4
	hkBool shouldReinitializeRagdollController; // C5
	hkBool isEnabled; // C6
	hkBool isPoweredControllerEnabled; // C7
	hkBool isRigidBodyControllerEnabled; // C8
	hkBool wasRigidBodyControllerEnabledLastFrame; // C9
	hkBool ragdollPoseWasUsed; // CA
	hkBool allBonesKeyframed; // CB
};
static_assert(offsetof(hkbRagdollDriver, character) == 0x80);
static_assert(sizeof(hkbRagdollDriver) == 0xD0);

struct hkbCharacterSetup : hkReferencedObject
{
	hkArray<hkRefPtr<hkaSkeletonMapper>> m_retargetingSkeletonMappers; // 10
	hkRefPtr<hkaSkeleton> m_animationSkeleton; // 20
	hkRefPtr<hkaSkeletonMapper> m_ragdollToAnimationSkeletonMapper; // 28
	hkRefPtr<hkaSkeletonMapper> m_animationToRagdollSkeletonMapper; // 30
	hkRefPtr<struct hkbAnimationBindingSet> m_animationBindingSet; // 38
	hkRefPtr<struct hkbCharacterData> m_data; // 40
	UInt64 unk48; // probably either m_unscaledAnimationSkeleton or m_mirroredSkeleton
	hkRefPtr<struct hkbSymbolIdMap> m_characterPropertyIdMap; // 50
	mutable hkCriticalSection *m_criticalSection; // 58
};

struct hkbCharacter : hkReferencedObject
{
	// members
	hkArray<hkbCharacter*>      nearbyCharacters;           // 10
	std::int16_t                currentLOD;                 // 20
	std::int16_t                numTracksInLOD;             // 22
	std::uint32_t               pad24;                      // 24
	hkStringPtr                 name;                       // 28
	hkRefPtr<hkbRagdollDriver>  ragdollDriver;              // 30
	hkRefVariant                characterControllerDriver;  // 38
	hkRefPtr<struct hkbFootIkDriver> footIkDriver;               // 40
	hkRefPtr<struct hkbHandIkDriver> handIkDriver;               // 48
	hkRefPtr<hkbCharacterSetup> setup;                      // 50
	hkRefPtr<struct hkbBehaviorGraph>  behaviorGraph;              // 58
	hkRefPtr<struct hkbProjectData>    projectData;                // 60
	hkRefPtr<struct hkbAnimationBindingSet> animationBindingSet;        // 68
	hkRefVariant                raycastInterface;           // 70
	hkRefVariant                world;                      // 78
	hkRefVariant                eventQueue;                 // 80
	hkRefVariant                worldFromModel;             // 88
	const void**                poseLocal;                  // 90 - hkSimpleArray<hkRefVariant>
	std::int32_t                numPoseLocal;               // 98
	bool                        deleteWorldFromModel;       // 9C
	bool                        deletePoseLocal;            // 9D
	std::uint16_t               pad9E;                      // 9E
};
static_assert(sizeof(hkbCharacter) == 0xA0);

struct hkbContext
{
	hkbCharacter *character; // 00
	UInt64 unk08;
	UInt64 unk10;
	UInt64 unk18;
	UInt64 unk20;
	UInt64 unk28;
	bool unk30;
	ahkpWorld *world; // 38
	UInt64 unk40;
	UInt64 unk48;
};
static_assert(offsetof(hkbContext, world) == 0x38);

struct hkbGeneratorOutput
{
	enum class StandardTracks
	{
		TRACK_WORLD_FROM_MODEL, // 00
		TRACK_EXTRACTED_MOTION, // 01
		TRACK_POSE, // 02
		TRACK_FLOAT_SLOTS, // 03
		TRACK_RIGID_BODY_RAGDOLL_CONTROLS, // 04
		TRACK_RIGID_BODY_RAGDOLL_BLEND_TIME, // 05
		TRACK_POWERED_RAGDOLL_CONTROLS, // 06
		TRACK_POWERED_RAGDOLL_WORLD_FROM_MODEL_MODE, // 07
		TRACK_KEYFRAMED_RAGDOLL_BONES, // 08
		TRACK_KEYFRAME_TARGETS, // 09
		TRACK_ANIMATION_BLEND_FRACTION, // 0A
		TRACK_ATTRIBUTES, // 0B
		TRACK_FOOT_IK_CONTROLS, // 0C
		TRACK_CHARACTER_CONTROLLER_CONTROLS, // 0D
		TRACK_HAND_IK_CONTROLS_0, // 0E
		TRACK_HAND_IK_CONTROLS_1, // 0F
		TRACK_HAND_IK_CONTROLS_2, // 10
		TRACK_HAND_IK_CONTROLS_3, // 11
		TRACK_HAND_IK_CONTROLS_NON_BLENDABLE_0, // 12
		TRACK_HAND_IK_CONTROLS_NON_BLENDABLE_1, // 13
		TRACK_HAND_IK_CONTROLS_NON_BLENDABLE_2, // 14
		TRACK_HAND_IK_CONTROLS_NON_BLENDABLE_3, // 15
		TRACK_DOCKING_CONTROLS, // 16
		TRACK_AI_CONTROL_CONTROLS_BLENDABLE, // 17
		TRACK_AI_CONTROL_CONTROLS_NON_BLENDABLE, // 18
		NUM_STANDARD_TRACKS, // 19
	};

	enum class TrackTypes
	{
		TRACK_TYPE_REAL, // 0
		TRACK_TYPE_QSTRANSFORM, // 1
		TRACK_TYPE_BINARY, // 2
	};

	enum class TrackFlags
	{
		TRACK_FLAG_ADDITIVE_POSE = 1,
		TRACK_FLAG_PALETTE = 1 << 1,
		TRACK_FLAG_SPARSE = 1 << 2,
	};

	struct TrackHeader
	{
		hkInt16 m_capacity; // 00
		hkInt16 m_numData; // 02
		hkInt16 m_dataOffset; // 04
		hkInt16 m_elementSizeBytes; // 06
		hkReal m_onFraction; // 08
		hkFlags<TrackFlags, hkInt8> m_flags; // 0C
		hkEnum<TrackTypes, hkInt8> m_type; // 0D
	};
	static_assert(sizeof(TrackHeader) == 0x10);

	struct TrackMasterHeader
	{
		hkInt32 m_numBytes; // 00
		hkInt32 m_numTracks; // 04
		hkInt8 m_unused[8]; // 08
	};

	struct Tracks
	{
		struct TrackMasterHeader m_masterHeader; // 00
		struct TrackHeader m_trackHeaders[1]; // 10
	};

	struct Track
	{
		TrackHeader* m_header; // 00
		hkReal* m_data; // 08
	};

	struct Tracks* m_tracks; // 00
	bool m_deleteTracks; // 08
};

struct hkbBindable : hkReferencedObject
{
	hkRefPtr<struct hkbVariableBindingSet> variableBindingSet;  // 10
	hkArray<hkRefVariant>           cachedBindables;     // 18
	bool                            areBindablesCached;  // 28
	std::uint8_t                    pad29;               // 29
	std::uint16_t                   pad2A;               // 2A
	std::uint32_t                   pad2C;               // 2C
};
static_assert(sizeof(hkbBindable) == 0x30);

struct hkbNode : hkbBindable
{
	std::uint32_t                              userData;    // 30
	std::uint32_t                              pad34;       // 34
	hkStringPtr                                name;        // 38
	std::uint16_t                              id;          // 40
	std::uint8_t                               cloneState;  // 42
	std::uint8_t                               pad43;       // 43
	std::uint32_t                              pad44;       // 44
};
static_assert(sizeof(hkbNode) == 0x48);

struct hkbGenerator : hkbNode {};
struct hkbBehaviorGraph : hkbGenerator {};

struct BShkbAnimationGraph
{
	virtual ~BShkbAnimationGraph();
	virtual bool HasRagdollInterface();
	virtual bool AddRagdollToWorld();
	virtual bool RemoveRagdollFromWorld();

	UInt8 unk08[0xC0 - 0x08];
	hkbCharacter character; // C0
	UInt8 unk160[0x208 - 0x160];
	hkbBehaviorGraph *behaviorGraph; // 208
	Actor *holder; // 210
	NiNode *rootNode; // 218
	UInt8 unk220[0x238 - 0x220];
	bhkWorld *world; // 238
	// more...
};
static_assert(offsetof(BShkbAnimationGraph, character) == 0xC0);
static_assert(offsetof(BShkbAnimationGraph, holder) == 0x210);

template <class T, UInt32 N = 1>
struct BSTSmallArray
{
	union Data
	{
		T* heap;
		T local[N];
	};

	SInt32 heapSize = 0x80000000; // 00
	UInt32 unk04; // 04
	Data data; // 08
	UInt32 size;
};

class BSAnimationGraphManager :
	BSTEventSink<BSAnimationGraphEvent>, // 00
	BSIntrusiveRefCounted // 08
{
public:
	UInt8 unk10[0x40 - 0x10];
	BSTSmallArray<BSTSmartPointer<BShkbAnimationGraph>> graphs; // 40
	UInt8 unk58[0x98 - 0x58];
	SimpleLock updateLock; // 98
	SimpleLock dependentManagerLock; // A0
	UInt32 activeGraph; // A8
	UInt32 generateDepth; // A8
};
static_assert(offsetof(BSAnimationGraphManager, graphs) == 0x40);
static_assert(offsetof(BSAnimationGraphManager, updateLock) == 0x98);

typedef bool(*_hkConstraintCinfo_setConstraintData)(struct hkConstraintCinfo *_this, hkpConstraintData *data);
RelocAddr<_hkConstraintCinfo_setConstraintData> hkConstraintCinfo_setConstraintData(0xE3E6F0);
struct hkConstraintCinfo
{
	~hkConstraintCinfo() {
		hkConstraintCinfo_setConstraintData(this, nullptr);
	}

	void *vtbl = 0; // 00
	havokRefPtr<hkpConstraintData> constraintData = 0; // 08
	UInt32 unk10 = 0;
	UInt32 unk14 = 0;
	hkpRigidBody *rigidBodyA = nullptr; // 18
	hkpRigidBody *rigidBodyB = nullptr; // 20
};

auto hkMalleableConstraintCinfo_vtbl = RelocAddr<void *>(0x182C5F8);
struct hkMalleableConstraintCinfo : hkConstraintCinfo
{
	hkMalleableConstraintCinfo()
	{
		this->vtbl = hkMalleableConstraintCinfo_vtbl;
	}
};

struct hkFixedConstraintCinfo : hkConstraintCinfo
{
	UInt64 unk28 = 0;
	UInt8 unk30 = 0; // type or something
};

auto bhkMalleableConstraint_vtbl = RelocAddr<void *>(0x182C628);
struct bhkMalleableConstraint : bhkConstraint
{
	UInt64 unk18 = 0;
};
static_assert(sizeof(bhkMalleableConstraint) == 0x20);

struct AIProcessManager
{
	UInt8  unk000;                   // 008
	bool   enableDetection;          // 001 
	bool   unk002;                   // 002 
	UInt8  unk003;                   // 003
	UInt32 unk004;                   // 004
	bool   enableHighProcess;        // 008 
	bool   enableLowProcess;         // 009 
	bool   enableMiddleHighProcess;  // 00A 
	bool   enableMiddleLowProcess;   // 00B 
	bool   enableAISchedules;        // 00C 
	UInt8  unk00D;                   // 00D
	UInt8  unk00E;                   // 00E
	UInt8  unk00F;                   // 00F
	SInt32 numActorsInHighProcess;   // 010
	UInt32 unk014[(0x30 - 0x014) / sizeof(UInt32)];
	tArray<UInt32>  actorsHigh; // 030 
	tArray<UInt32>  actorsLow;  // 048 
	tArray<UInt32>  actorsMiddleLow; // 060
	tArray<UInt32>  actorsMiddleHigh; // 078
	UInt32  unk90[(0xF0 - 0x7C) / sizeof(UInt32)];
	tArray<void*> activeEffectShaders; // 108
									   //mutable BSUniqueLock			 activeEffectShadersLock; // 120
};

RelocPtr<AIProcessManager *> g_aiProcessManager(0x01F831B0);


typedef bool(*_bhkRefObject_ctor)(bhkRefObject *_this);
RelocAddr<_bhkRefObject_ctor> bhkRefObject_ctor(0xE306A0);

typedef bool(*_hkMalleableConstraintCinfo_Func4)(hkMalleableConstraintCinfo *_this);
RelocAddr<_hkMalleableConstraintCinfo_Func4> hkMalleableConstraintCinfo_Func4(0xE3DD20);

typedef bool(*_hkMalleableConstraintCinfo_setWrappedConstraintData)(hkMalleableConstraintCinfo *_this, hkpConstraintData *data);
RelocAddr<_hkMalleableConstraintCinfo_setWrappedConstraintData> hkMalleableConstraintCinfo_setWrappedConstraintData(0xE3DE70);

typedef bool(*_hkMalleableConstraintCinfo_setStrength)(hkMalleableConstraintCinfo *_this, float strength);
RelocAddr<_hkMalleableConstraintCinfo_setStrength> hkMalleableConstraintCinfo_setStrength(0xE3DE90);

typedef bool(*_Actor_IsInRagdollState)(Actor *_this);
